astb_relise/src/DataProcessors/СписаниеВыданныхСИЗПоПричине/СписаниеВыданныхСИЗПоПричине.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СписаниеВыданныхСИЗПоПричине</name>
  <comment>Списание выданных СИЗ по причине окончания срока носки, увольнению или отмене норм.</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСписания</name>
    <type>
      <types>EnumRef.ПричиныСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаНормВыдачи</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаНоменклатурыНорм</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНорм</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаНоменклатуры</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

astb_relise/src/Enums/ВидыВыдачиСИЗ/ВидыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВыдачиСИЗ</name>
  <enumValues>
    <name>КоллективнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПерсональнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяВыдача</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Enums/ПричиныСписания/ПричиныСписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныСписания</name>
  <enumValues>
    <name>Брак</name>
  </enumValues>
  <enumValues>
    <name>Износ</name>
  </enumValues>
  <enumValues>
    <name>Порча</name>
  </enumValues>
  <enumValues>
    <name>Пропажа</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>ОкончаниеСрокаНоски</name>
  </enumValues>
  <enumValues>
    <name>ОтменаНорм</name>
  </enumValues>
  <enumValues>
    <name>ТехническоеСписание</name>
    <comment>АСТБ_Горюшин_Алексей_20510</comment>
  </enumValues>
</mdclass:Enum>

astb_relise/src/DataProcessors/СписаниеВыданныхСИЗПоПричине/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыполнитьСписание(Команда)
	
	ВыполнитьСписаниеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСписаниеНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Обработки.СписаниеВыданныхСИЗПоПричине.СформироватьДокументыСписанияСИЗ(ТекущийОбъект);
	Обработки.СписаниеВыданныхСИЗПоПричине.ЗаполнитьСписокСотрудников(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокСотрудников(Команда)
	
	ЗаполнитьСписокСотрудниковНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСотрудниковНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Обработки.СписаниеВыданныхСИЗПоПричине.ЗаполнитьСписокСотрудников(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	Объект.СписокСотрудников.Очистить();
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаАнализаПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидВыдачиСИЗПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаАнализа 		= ТекущаяДата();
	Объект.ВидВыдачиСИЗ 	= Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача;
	Объект.ПричинаСписания 	= Перечисления.ПричиныСписания.ОкончаниеСрокаНоски;
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	ЗаполнитьТаблицуНоменклатурыНаСервере();
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаСписанияПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
	Если НЕ Объект.ПричинаСписания = ПредопределенноеЗначение("Перечисление.ПричиныСписания.Увольнение")
		И Объект.ВидВыдачиСИЗ = ПредопределенноеЗначение("Перечисление.ВидыВыдачиСИЗ.ПроизвольнаяВыдача") Тогда
		Объект.ВидВыдачиСИЗ = ПредопределенноеЗначение("Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача");
	КонецЕсли;	
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Если Объект.ПричинаСписания = Перечисления.ПричиныСписания.Увольнение ИЛИ Объект.ПричинаСписания = Перечисления.ПричиныСписания.ТехническоеСписание Тогда
		Элементы.ВидВыдачиСИЗ1.Видимость 	= Истина;
		Элементы.ВидВыдачиСИЗ.Видимость 	= Ложь;
	Иначе
		Элементы.ВидВыдачиСИЗ1.Видимость 	= Ложь;
		Элементы.ВидВыдачиСИЗ.Видимость 	= Истина;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура РабочееМестоПриИзменении(Элемент)
	
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Обработки.СписаниеВыданныхСИЗПоПричине.ЗаполнитьТаблицуНормВыдачи(ТекущийОбъект); 
	Обработки.СписаниеВыданныхСИЗПоПричине.ЗаполнитьТаблицуНоменклатурыНорм(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");  
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуНоменклатурыНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Обработки.СписаниеВыданныхСИЗПоПричине.ЗаполнитьТаблицуНоменклатуры(ТекущийОбъект); 
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");  
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьФлажкиНаСервере(ЗначениеФлажка,ИмяТаблицы)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Таблица = ТекущийОбъект[ИмяТаблицы].ВЫгрузить();
	Таблица.ЗаполнитьЗначения(ЗначениеФлажка,"Использовать");
	ТекущийОбъект[ИмяТаблицы].Загрузить(Таблица);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиУстановитьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Истина,"СписокСотрудников");
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСнятьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Ложь,"СписокСотрудников");
	
КонецПроцедуры

&НаКлиенте
Процедура НормыВыдачиУстановитьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Истина,"ТаблицаНормВыдачи");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НормыВыдачиСнятьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Ложь,"ТаблицаНормВыдачи");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНормУстановитьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Истина,"ТаблицаНоменклатурыНорм");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНормСнятьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Ложь,"ТаблицаНоменклатурыНорм");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураУстановитьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Истина,"ТаблицаНоменклатуры");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСнятьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Ложь,"ТаблицаНоменклатуры");
	Объект.СписокСотрудников.Очистить();
	
КонецПроцедуры
